#include "Controller.h"

/*
    Скласти програму, яка в діалоговому режимі керує графічними об’єктами, що
    відображаються на екрані дисплея.
    Програма повинна підтримувати такі загальні елементи поведінки графічних
    об’єктів:
    1. Активізація/візуалізація за вибором.                                                                 +
    2. Переміщення зі слідом/без.                                                                           +
    3. Відновлення початкового стану образа.                                                                +
    4. Зміна кольору.                                                                                       +
    5. Зміна стану видимий/невидимий.                                                                       +
    6. При агрегації об’єктів забезпечити можливість агрегації агрегатів.                                   +

    1. Завершення роботи з об’єктом: 0. Зникає.                                                             +
    2. Рух об’єкта в автоматичному режимі: 0. За заданим законом.                                           +
    3. Зміна кольору і деформація: 0. Зміна кольору по команді, деформація під впливом іншого об’єкта.      + +
    4. Дія при досягненні краю вікна: 0. Рух продовжується з протилежного краю вікна.                       +
    5. Збірка / запам’ятання агрегованого образа: 1. Видаленням.                                            +
*/

Controller* Controller::instance = nullptr;

int main()
{
    srand(time(NULL));
    Controller::get_instance()->start_demonstration();
}